
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланыПродаж
	Движения.ПланыПродаж.Записывать = Истина;
	Для Каждого ТекСтрокаПланыПродаж Из ПланыПродаж Цикл
		Движение = Движения.ПланыПродаж.Добавить();
		Движение.Период = Месяц;
		Движение.Менеджер = ТекСтрокаПланыПродаж.Менеджер;
		Движение.СуммаПродаж = ТекСтрокаПланыПродаж.СуммаПродаж;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
