
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БонусныеПрограммы
	Движения.БонусныеПрограммы.Записывать = Истина;
	Для Каждого ТекСтрокаНастройки Из Настройки Цикл
		Движение = Движения.БонусныеПрограммы.Добавить();
		Движение.Период = ДействуетС;
		Движение.ПрограммаЛояльности = ТекСтрокаНастройки.ПрограммаЛояльности;
		Движение.УсловияПолучения = ТекСтрокаНастройки.УсловияПолучения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
